wrk_rps_merged/534
Running 5m test @ http://10.108.98.213:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 226.656ms, rate sampling interval: 927ms
  Thread calibration: mean lat.: 224.148ms, rate sampling interval: 1007ms
  Thread calibration: mean lat.: 240.278ms, rate sampling interval: 991ms
  Thread calibration: mean lat.: 232.648ms, rate sampling interval: 949ms
  Thread calibration: mean lat.: 235.418ms, rate sampling interval: 943ms
  Thread calibration: mean lat.: 264.788ms, rate sampling interval: 988ms
  Thread calibration: mean lat.: 254.561ms, rate sampling interval: 950ms
  Thread calibration: mean lat.: 253.380ms, rate sampling interval: 1078ms
  Thread calibration: mean lat.: 261.038ms, rate sampling interval: 957ms
  Thread calibration: mean lat.: 252.922ms, rate sampling interval: 969ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   226.09ms  171.61ms   1.58s    78.18%
    Req/Sec     9.56      3.02    28.00     84.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  184.57ms
 75.000%  282.62ms
 90.000%  398.08ms
 99.000%  884.73ms
 99.900%    1.26s 
 99.990%    1.48s 
 99.999%    1.58s 
100.000%    1.58s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.473     0.000000            1         1.00
      35.327     0.100000         2908         1.11
      83.391     0.200000         5806         1.25
     147.839     0.300000         8714         1.43
     168.959     0.400000        11621         1.67
     184.575     0.500000        14507         2.00
     237.055     0.550000        15960         2.22
     248.063     0.600000        17412         2.50
     257.791     0.650000        18870         2.86
     267.775     0.700000        20331         3.33
     282.623     0.750000        21766         4.00
     332.287     0.775000        22486         4.44
     341.503     0.800000        23211         5.00
     351.231     0.825000        23949         5.71
     359.167     0.850000        24661         6.67
     370.175     0.875000        25386         8.00
     379.903     0.887500        25747         8.89
     398.079     0.900000        26112        10.00
     440.319     0.912500        26473        11.43
     452.863     0.925000        26836        13.33
     466.687     0.937500        27195        16.00
     479.743     0.943750        27377        17.78
     512.511     0.950000        27558        20.00
     552.959     0.956250        27741        22.86
     572.927     0.962500        27922        26.67
     634.367     0.968750        28102        32.00
     655.359     0.971875        28193        35.56
     669.695     0.975000        28283        40.00
     689.663     0.978125        28374        45.71
     757.759     0.981250        28465        53.33
     778.239     0.984375        28556        64.00
     809.471     0.985938        28602        71.11
     861.183     0.987500        28646        80.00
     876.031     0.989062        28691        91.43
     895.999     0.990625        28738       106.67
     949.759     0.992188        28783       128.00
     966.655     0.992969        28806       142.22
     971.775     0.993750        28827       160.00
     995.839     0.994531        28850       182.86
    1067.007     0.995313        28873       213.33
    1083.391     0.996094        28896       256.00
    1138.687     0.996484        28907       284.44
    1155.071     0.996875        28918       320.00
    1160.191     0.997266        28929       365.71
    1166.335     0.997656        28941       426.67
    1234.943     0.998047        28952       512.00
    1242.111     0.998242        28958       568.89
    1250.303     0.998437        28965       640.00
    1253.375     0.998633        28969       731.43
    1262.591     0.998828        28975       853.33
    1265.663     0.999023        28982      1024.00
    1266.687     0.999121        28984      1137.78
    1272.831     0.999219        28986      1280.00
    1283.071     0.999316        28990      1462.86
    1284.095     0.999414        28992      1706.67
    1286.143     0.999512        28994      2048.00
    1288.191     0.999561        28996      2275.56
    1315.839     0.999609        28997      2560.00
    1336.319     0.999658        28999      2925.71
    1340.415     0.999707        29000      3413.33
    1362.943     0.999756        29001      4096.00
    1373.183     0.999780        29002      4551.11
    1399.807     0.999805        29003      5120.00
    1474.559     0.999829        29004      5851.43
    1474.559     0.999854        29004      6826.67
    1476.607     0.999878        29005      8192.00
    1476.607     0.999890        29005      9102.22
    1481.727     0.999902        29006     10240.00
    1481.727     0.999915        29006     11702.86
    1481.727     0.999927        29006     13653.33
    1577.983     0.999939        29007     16384.00
    1577.983     0.999945        29007     18204.44
    1577.983     0.999951        29007     20480.00
    1577.983     0.999957        29007     23405.71
    1577.983     0.999963        29007     27306.67
    1580.031     0.999969        29008     32768.00
    1580.031     1.000000        29008          inf
#[Mean    =      226.088, StdDeviation   =      171.612]
#[Max     =     1579.008, Total count    =        29008]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30046 requests in 5.00m, 146.86MB read
Requests/sec:    100.13
Transfer/sec:    501.16KB