wrk_rps_merged/548
Running 5m test @ http://10.110.59.10:80
  10 threads and 100 connections
  Thread calibration: mean lat.: 306.581ms, rate sampling interval: 1263ms
  Thread calibration: mean lat.: 326.767ms, rate sampling interval: 1247ms
  Thread calibration: mean lat.: 315.254ms, rate sampling interval: 1211ms
  Thread calibration: mean lat.: 319.114ms, rate sampling interval: 1221ms
  Thread calibration: mean lat.: 323.720ms, rate sampling interval: 1175ms
  Thread calibration: mean lat.: 338.628ms, rate sampling interval: 1261ms
  Thread calibration: mean lat.: 343.714ms, rate sampling interval: 1255ms
  Thread calibration: mean lat.: 338.378ms, rate sampling interval: 1219ms
  Thread calibration: mean lat.: 353.637ms, rate sampling interval: 1258ms
  Thread calibration: mean lat.: 357.231ms, rate sampling interval: 1212ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   369.16ms  230.23ms   1.94s    71.10%
    Req/Sec     9.51      2.82    18.00     84.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  376.83ms
 75.000%  496.89ms
 90.000%  612.35ms
 99.000%    1.18s 
 99.900%    1.77s 
 99.990%    1.89s 
 99.999%    1.94s 
100.000%    1.94s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.495     0.000000            1         1.00
      80.383     0.100000         2900         1.11
     207.231     0.200000         5807         1.25
     231.039     0.300000         8711         1.43
     308.991     0.400000        11620         1.67
     376.831     0.500000        14500         2.00
     392.959     0.550000        15966         2.22
     404.991     0.600000        17404         2.50
     419.071     0.650000        18851         2.86
     484.607     0.700000        20305         3.33
     496.895     0.750000        21750         4.00
     504.319     0.775000        22485         4.44
     515.327     0.800000        23205         5.00
     575.999     0.825000        23928         5.71
     586.239     0.850000        24670         6.67
     595.967     0.875000        25392         8.00
     603.135     0.887500        25739         8.89
     612.351     0.900000        26108        10.00
     634.367     0.912500        26467        11.43
     684.031     0.925000        26832        13.33
     695.295     0.937500        27210        16.00
     701.439     0.943750        27379        17.78
     709.631     0.950000        27554        20.00
     723.455     0.956250        27733        22.86
     781.311     0.962500        27918        26.67
     791.039     0.968750        28096        32.00
     799.231     0.971875        28192        35.56
     807.423     0.975000        28279        40.00
     818.175     0.978125        28369        45.71
     879.103     0.981250        28457        53.33
     904.703     0.984375        28550        64.00
     914.943     0.985938        28593        71.11
     945.151     0.987500        28638        80.00
    1102.847     0.989062        28684        91.43
    1192.959     0.990625        28731       106.67
    1215.487     0.992188        28774       128.00
    1275.903     0.992969        28798       142.22
    1323.007     0.993750        28819       160.00
    1399.807     0.994531        28844       182.86
    1499.135     0.995313        28865       213.33
    1587.199     0.996094        28887       256.00
    1618.943     0.996484        28899       284.44
    1633.279     0.996875        28912       320.00
    1657.855     0.997266        28922       365.71
    1699.839     0.997656        28933       426.67
    1713.151     0.998047        28946       512.00
    1715.199     0.998242        28950       568.89
    1721.343     0.998437        28956       640.00
    1729.535     0.998633        28962       731.43
    1740.799     0.998828        28967       853.33
    1773.567     0.999023        28972      1024.00
    1779.711     0.999121        28976      1137.78
    1781.759     0.999219        28979      1280.00
    1783.807     0.999316        28981      1462.86
    1785.855     0.999414        28985      1706.67
    1786.879     0.999512        28986      2048.00
    1796.095     0.999561        28988      2275.56
    1797.119     0.999609        28989      2560.00
    1802.239     0.999658        28992      2925.71
    1802.239     0.999707        28992      3413.33
    1807.359     0.999756        28993      4096.00
    1808.383     0.999780        28994      4551.11
    1828.863     0.999805        28995      5120.00
    1889.279     0.999829        28996      5851.43
    1889.279     0.999854        28996      6826.67
    1890.303     0.999878        28997      8192.00
    1890.303     0.999890        28997      9102.22
    1908.735     0.999902        28998     10240.00
    1908.735     0.999915        28998     11702.86
    1908.735     0.999927        28998     13653.33
    1921.023     0.999939        28999     16384.00
    1921.023     0.999945        28999     18204.44
    1921.023     0.999951        28999     20480.00
    1921.023     0.999957        28999     23405.71
    1921.023     0.999963        28999     27306.67
    1936.383     0.999969        29000     32768.00
    1936.383     1.000000        29000          inf
#[Mean    =      369.159, StdDeviation   =      230.227]
#[Max     =     1935.360, Total count    =        29000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  30043 requests in 5.00m, 168.78MB read
Requests/sec:    100.12
Transfer/sec:    575.94KB